# write reports:
report_design           > ${REP_PATH}/design.txt
report_timing           > ${REP_PATH}/timing.txt
report_power            > ${REP_PATH}/power.txt
report_area             > ${REP_PATH}/area.txt
report_reference        > ${REP_PATH}/reference.txt
report_resources        > ${REP_PATH}/resources.txt
check_design            > ${REP_PATH}/check_design.txt
